{
  "content": "<h1><strong>我放弃了鸿蒙Next，回归了使用鸿蒙4.2的用户阵营</strong></h1>\n<p>我一直希望能找到一个有效的方法来戒掉玩《炉石传说》的瘾，在与多位《炉石传说》玩家交流后，我了解到华为的<strong>鸿蒙Next</strong>系统并不支持这款游戏。再三权衡之下，我决定毫不犹豫地将我的设备升级到<strong>鸿蒙Next</strong>系统。</p>\n<p>然而，今天我在尝试用“粤省事”处理一些个人事务时，这个小程序屏幕上弹出了一个提示框：“检测到微信版本过低，请升级版本使用”。估计粤省事检测是安卓版本的微信版本，是8.0+的版本，但是鸿蒙系统的微信版本却停留在1.x+de版本，似乎没有提供进一步的更新选项。</p>\n<p>为了个人业务的顺利开展，我不得已还是退回到了<strong>鸿蒙4.2版本</strong>的系统。</p>\n<h2><strong>系统版本之间的差异和个人感受</strong></h2>\n<h3><strong>坏的方面</strong></h3>\n<ul>\n<li><strong>鸿蒙Next支持了主流应用的使用</strong>，但是也就只是<strong>主流应用的主流功能</strong>而已。</li>\n<li>鸿蒙Next版本的<strong>微信的发现页没有“看一看”，也没有了“搜一搜”</strong>，适合不需要通过微信探索世界的人使用。</li>\n<li>鸿蒙Next版本的<strong>微信输入法输入“时间”</strong>，比如现在是北京时间18:00，结果它显示出来的时间却是10:00。上线得太赶，都没有针对一些特殊输入早做调整。</li>\n<li>鸿蒙Next版本的<strong>百度地图在显示顺风车司机位置的时候，地图页面的刷新极其卡顿</strong>。</li>\n<li>鸿蒙Next版本的<strong>抖音好像不支持视频横屏播放</strong>，或许是我个人视力的问题，没有看到转横屏的操作按钮。</li>\n<li>腾讯元宝和DeepSeek需要通过一个叫做“卓易通”的APP来加载使用。和安卓版本的差异就是不能够滚动截屏了，不免让我想起了IOS用户的同样的不便利。</li>\n</ul>\n<p>所谓的这些坏的方面，更多的是各主流APP为了在鸿蒙Next版本保持用户黏性，不得不出一个能用的产品罢了。应该给予一定的理解。</p>\n<h3><strong>好的方面</strong></h3>\n<p>因为我并不是深度用户，所以一些鸿蒙Next的好并没有深度挖掘出来。</p>\n<ul>\n<li><strong>鸿蒙Next的小艺支持连续对话</strong>了。不需要每次下达指令都需要通过“小艺小艺”进行唤醒了。鸿蒙4.2版本的，好像还不支持，需要继续深入研究。</li>\n<li>权限管控是非常的严格，一个内置了Google Ads广告的网站，广告根本就加载不出来。且一个应用想获取相册、联系人的信息，只提供机主选择的照片或者联系人信息，这个是挺不错的功能，只不过鉴于现在个性信息已经满天飞了，这个防范措施有点事后诸葛了。</li>\n<li>针对图库的图片有AI修图的功能，比如一个老鼠的尾巴被水印给遮挡住去了，可以利用这个功能给去掉水印，自动重绘水印区域，将“断掉的尾巴”给接上。“毫无修图”痕迹。</li>\n</ul>\n<h2><strong>怎么看待鸿蒙Next的系统的推广呢？</strong></h2>\n<p>炉石回归国服的时候，有一段时间的服务器故障，玩家们都需要在“炉石的大门”前苦苦等待15分钟，甚至更久才能进入游戏。当时我就觉得这种问题对于IT人员来讲并不是什么很难的事情，只是工期赶，压力大，就容易出没有在计划之内的问题。</p>\n<p>时代总是向前发展的，“粤省事”的程序员某一天加上了针对“鸿蒙Next”系统的微信的版本判定，再做针对鸿蒙Next系统的优化，那就可以让终端客户在使用“粤省事”的时候，无感于系统直接的差异。</p>\n<p>或许，将来的某一天，鸿蒙版本的各个APP在使用上面会跟Android版本或者IOS版本的APP一样，使用效果差不多。但是，这对不支持跨平台运行的APP来说，适配各操作系统来说那就是成倍的工作量，是一个巨大的挑战。建议开发产品的IT从业人员，在做产品的时候，真的要做好技术的选型。</p>\n<p>面对那些在使用鸿蒙4.2+系统的手机用户，如果你不是手机的深度用户，可以考虑升级到鸿蒙Next版本的操作系统使用，整个备份还原的过程还是比较顺畅的，数据量大的话备份还原的时间会稍微长一点。如果你是需要使用各个APP以及小程序，建议等鸿蒙Next系统达到基本可用的状态下再去进行升级，就不要“没苦硬吃”给自己找不自在了。</p>\n",
  "meta": {
    "title": "我放弃了鸿蒙Next，回归了使用鸿蒙4.2的用户阵营",
    "category": "生活感悟",
    "tags": [
      "鸿蒙系统",
      "系统升级",
      "用户体验",
      "科技生活",
      "手机应用"
    ],
    "description": "本文记录了作者尝试使用鸿蒙Next系统但最终选择回归鸿蒙4.0系统的经历，分享了不同版本系统间的差异和个人感受。"
  }
}